{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_11","layers":[{"class_name":"Dense","config":{"units":1,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense21","trainable":true,"batch_input_shape":[null,1],"dtype":"float32"}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22","trainable":true}}]},"keras_version":"tfjs-layers 4.14.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.14.0","convertedBy":null,"weightsManifest":[{"paths":["./trained_model.weights.bin"],"weights":[{"name":"dense_Dense21/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense21/bias","shape":[1],"dtype":"float32"},{"name":"dense_Dense22/kernel","shape":[1,1],"dtype":"float32"},{"name":"dense_Dense22/bias","shape":[1],"dtype":"float32"}]}]}